Tekla Open API Reference for Tekla Structures 2025
Arc Class
 Represents an arc geometry
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Arc
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Arc : ICurve, IEquatable<ICurve>
<SerializableAttribute>
Public Class Arc
	Implements ICurve, IEquatable(Of ICurve)
The Arc type exposes the following members.
Constructors
Name | Description
Arc(Point, Point, Point)
 Constructs a new arc geometry
Arc(Point, Point, Vector, Double)
 Constructs a new arc geometry
Arc(Point, Vector, Vector, Double, Double)
 Constructs a new arc geometry
Top
Properties
Name | Description
Angle
 Gets angle of the arc in radians.
ArcMiddlePoint
 Gets the point located at the middle of the arc
CenterPoint
 Gets or sets center point of the arc.
EndPoint
 Gets or sets end point of the arc.
Length
 Returns the length of the arc
Normal
 Gets normal of the arc, which defines the axis of rotation of the radial vector pointing to the start point of the arc.
Radius
 Gets the radius of the arc.
StartDirection
 Gets the unit vector which points from the center point to the start point of the arc, which defines the X axis of the arc coordinate system.
StartPoint
 Gets or sets start point of the arc.
StartTangent
 Gets the unit vector tangent to the start point which defines the Y axis of the arc coordinate system
Top
Methods
Name | Description
Clone
 Returns a copy of itself
Equals(Object)
 Checks for equality with another arc
 (Overrides Object.Equals(Object).)
Equals(ICurve)
 Checks for equality with another curve
GetHashCode
 Get HashCode override
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace